Cases/container/container_noOutside/constant/airInside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

container
{
    // type        transparent;

    // wallAbsorptionEmissionModel
    // {
    //     type            multiBandAbsorption;
    //     emissivity      (1 1);
    //     absorptivity    (0 0);
    // }
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;;
        absorptivity    (0.7 0.7);
        emissivity      (0.7 0.7);
    };
}

// bottom
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.1 0.1);
//         emissivity      (0.1 0.1);
//     };
// }

airInside_to_batterie0
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.7 0.7);
        emissivity      (0.7 0.7);
    };
}

// ************************************************************************* //
